* 1.2.5
	Core Idea: Better Chaining Support


** Handling Drawers in Chained Sources

  #+NAME: tbl-source
  | a | b | c | d | e |
  | 1 | 2 | 3 | 4 | 5 |

  This source block uses the output from the table above

  #+NAME: python-src
  #+BEGIN_SRC python :results drawer table :var DATA=tbl-source
   print(DATA)
  #+END_SRC

  #+RESULTS:
   :results:
   | a | b | c | d | e |
   | 1 | 2 | 3 | 4 | 5 |
   :end:

   This source block uses the output from python-src as an input

   #+BEGIN_SRC python :results table :var DATA=python-src
    print(DATA) 
   #+END_SRC

   #+RESULTS:
   | a | b | c | d | e |
   | 1 | 2 | 3 | 4 | 5 |

** Handling Lists in Chained Sources

	Here we have a list that acts as a source for some python that acts as a source for more python.

	#+NAME: lst-source
	1. a
	2. b
	3. c

	#+NAME: python-lstsrc
	#+BEGIN_SRC python :results drawer list :var DATA=lst-source
	  print(DATA)
	#+END_SRC

   #+RESULTS:
   :results:
   - a
   - b
   - c
   :end:

   #+BEGIN_SRC python :results list :var DATA=python-lstsrc
    print(DATA) 
   #+END_SRC

   #+RESULTS:
   - a
   - b
   - c

** Numeric and Text Values

	Here the powershell scripts results are piped into the python script.

   #+NAME: ps-src
   #+BEGIN_SRC powershell :results value
	return 5     
   #+END_SRC
   #+RESULTS:
   : 5

   #+BEGIN_SRC python :results drawer :var DATA=ps-src
     print(DATA)
   #+END_SRC

   #+RESULTS:
   :results:
   5
   :end:
